{"convertedBy": "TensorFlow.js Converter v1.5.2", "format": "layers-model", "weightsManifest": [{"weights": [{"name": "dense/kernel", "shape": [47, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1, 47], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [47], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"training_config": {"optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "learning_rate": 0.0010000000474974513, "decay": 0.0, "name": "Adam", "epsilon": 1e-07, "amsgrad": false, "beta_2": 0.9990000128746033}}, "weighted_metrics": null, "loss_weights": null, "sample_weight_mode": null, "metrics": ["accuracy"], "loss": "mean_squared_error"}, "backend": "tensorflow", "keras_version": "2.2.4-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "use_bias": true, "units": 1, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 47]}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "use_bias": true, "units": 47, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential"}}}, "generatedBy": "keras v2.2.4-tf"}