{"modelTopology": {"training_config": {"loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false, "name": "Adam", "decay": 0.0, "learning_rate": 0.0010000000474974513}, "class_name": "Adam"}, "weighted_metrics": null, "loss": "mean_squared_error"}, "backend": "tensorflow", "keras_version": "2.2.4-tf", "model_config": {"config": {"layers": [{"config": {"activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "trainable": true, "batch_input_shape": [null, 47], "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "name": "dense"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "units": 47, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "name": "dense_1"}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential"}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [47, 1], "name": "dense/kernel", "dtype": "float32"}, {"shape": [1], "name": "dense/bias", "dtype": "float32"}, {"shape": [1, 47], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [47], "name": "dense_1/bias", "dtype": "float32"}]}], "format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.5.2"}