{"convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": {"backend": "tensorflow", "training_config": {"loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "epsilon": 1e-07, "decay": 0.0, "name": "Adam", "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "amsgrad": false}, "class_name": "Adam"}, "loss": "mean_squared_error", "metrics": ["accuracy"]}, "model_config": {"config": {"name": "sequential", "layers": [{"config": {"bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "name": "dense", "kernel_regularizer": null, "batch_input_shape": [null, 47], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 1, "dtype": "float32", "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 47, "dtype": "float32", "bias_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "keras_version": "2.2.4-tf"}, "format": "layers-model", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "dtype": "float32", "shape": [47, 1]}, {"name": "dense/bias", "dtype": "float32", "shape": [1]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [1, 47]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [47]}]}], "generatedBy": "keras v2.2.4-tf"}